# GetEdgeReference1 Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdgeEdgeIntersection..::..GetEdgeReference1 Method
PointOnEdgeEdgeIntersection Class See Also
---
Get a copy of the first edge or curve reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetEdgeReference1()
```

Visual Basic
---
```text
Public Function GetEdgeReference1 As Reference
```

Visual C++
---
```text
public:
Reference^ GetEdgeReference1()
```

# See Also
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace